html/posts/core-network.html
<!DOCTYPE html>
<html>
<head>
<!-- 2020-09-02 Wed 14:53 -->
<meta charset="utf-8">
<title>Core Network</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Quan Vu">
<meta name="twitter:site" content="@null" />
<meta name="twitter:creator" content="@null" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="icon" type="image/png" href="https://vhquan.github.io/.images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="https://vhquan.github.io/.images/icon/apple-touch-icon.png" />
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/font.css">
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/main.css">
</head>
<body>
<div id="wrapper">
<div id="preamble" class="status">
<h1 class="title"><a href="https://vhquan.github.io">Quan Vu's Blog</a></h1>

<nav>
  <div class="navitem"><a href="https://vhquan.github.io">About</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/posts/index.html">Blog</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/portfolio/portfolio.html">Portfolio</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/contact/contact.html">Contact</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/resume/resume.html">R&eacute;sum&eacute;</a></div>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Core Network</h1>
</header><p>
In telecommunication, the core network is the central element of a network that provides services to customers who are connected by the access network.
</p>
<div class="more">

</div>
<p>
There are a number of services that the core network provides, but one of the main functions is to route telephone calls across the PSTN (public switched telephone network). Typically, in telecommunication networks, the term "core" is used by service providers and refers to the high capacity communication 
facilities that connect primary nodes. A core/backbone network network provides paths for the exchange of information between different sub-networks.
</p>

<p>
Core/Backbone networks usually have a mesh topology that provides any-to-any connections among devices on the network. Many service providers would have their own core/backbone networks that are interconnected. Some large enterprises have their own core/backbone network, which are typically connected to the 
public networks.
</p>

<p>
The devices and facilities in the core/backbone networks are switches and routes such as the Ericsson AXD 301 and Siemens EWSD. The trend is to keep the core devices fast, but not particularly 'clever', leaving the devices with the intelligence and decision making in the access and edge ares of the network. Technologies 
used in the core and backbone facilities are data link layer and network layer technologies such as SONET, DWDM, ATM, IP, etc. For enterprise backbone network, Gigabit Ethernet 10 Gigabit Ethernet Technologies are also often used.
</p>

<p>
<a href="https://www.carritech.com/news/core-networks/">https://www.carritech.com/news/core-networks/</a>
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Backbone_network">https://en.wikipedia.org/wiki/Backbone_network</a>
</p>
</div>
<div id="postamble" class="status">
<div id="footer">
<p>Proudly with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>.</div>
</div>
</div>
</body>
</html>
